test/artillery/result/testGetResult.yml
config:
  target: https://patena-api.herokuapp.com
  payload:
    # path relativo a la localización del script de test
    path: "orderNumber.csv"
    fields:
      - "OrderNumber"
      - "Token"
  phases:
    - duration: 60
      arrivalRate: 16
      name: get Results
  defaults:
    headers:
      Authorization: 'Bearer {{Token}}'
scenarios:
  - flow:
      - get:
          # TODO get valid token
          url: "/results?orderNumber={{ OrderNumber }}"
          headers:
            Authorization: 'Bearer {{Token}}'